# FailureResolution Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FailureResolution Properties
FailureResolution Class See Also
---
The FailureResolution type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
FailureResolution Class
Autodesk.Revit.DB Namespace